# IsValidType Method (ElementId)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..IsValidType Method (ElementId)
Element Class See Also
---
Checks if given type is valid for this element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsValidType(
	ElementId typeId
)
```

Visual Basic
---
```text
Public Function IsValidType ( _
	typeId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidType(
	ElementId^ typeId
)
```

# ### Parameters
typeId
    Type: Autodesk.Revit.DB..::..ElementId ElementId of the type to check.
# ### Return Value
True if element can have a type assigned and this type is valid for this element, false otherwise.
# Remarks
A type is valid for an element if it can be assigned to the element.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Element Class
IsValidType Overload
Autodesk.Revit.DB Namespace